Ameba-AIoT/ameba-arduino-pro2/Arduino_package/hardware/system/component/soc/8735b/fwlib/rtl8735b/include/rtl8735b_uart.h
/// the value to check the line status error
#define UART_LSR_ERR                (HAL_UART_STATUS_ERR_OVERRUN | HAL_UART_STATUS_ERR_PARITY | \
                                     HAL_UART_STATUS_ERR_FRAM | HAL_UART_STATUS_ERR_BREAK |\
                                     HAL_UART_STATUS_ERR_RXFIFO)

/**
  \brief  Defines the hardware flow control types.
*/
enum uart_flow_ctrl_setting_e {
	UartFlowCtlNone     = 0,
	UartFlowCtlRTS      = 1,
	UartFlowCtlCTS      = 2,
	UartFlowCtlRTSCTS   = 3
};

/*
 \brief   Defines the UART SCLK status.
*/
enum _HAL_UART_SCLK_STATUS_ {
	UartSCLK_4M     = 0x0,      ///< for UART0
	UartSCLK_26M    = 0x1,      ///< for UART0
	UartSCLK_40M    = 0x2,      ///< for UART0
	UartSCLK_50M    = 0x3       ///< for UART1~UART4
};

/// The special timeout value as the wait forever.
#define UART_WAIT_FOREVER       0xffffffff

#define UART_DMA_MBLK_NUM       16      // maximum block number for each DMA transfer, it must <= 16
#define UART_DMA_BLOCK_SIZE     4092    // the block size of multiple block DMA, it cannot over 4095

/**
  \brief  UART call back function for TX/RX done, RX filter and RX idle events.
*/
typedef void (*uart_callback_t)(void *arg);
/**
  \brief  UART call back function for line status error events.
*/
typedef void (*uart_lsr_callback_t)(uint8_t lsr, void *arg);
/**
  \brief  UART call back function for TX done or RX data ready interrupr.
*/
typedef void (*uart_irq_callback_t)(uint32_t id, uint32_t event);

/**
  * @brief The structure to be used to pass the parameters for
  *        the calculation of OVSR and divisor  for a given baud rate.
  */
typedef struct uart_speed_setting_s {
	uint32_t baudrate;       /*!< baud rate setting */
	uint32_t ovsr;           /*!< generated over sampling value */
	uint32_t div;            /*!< generated divisor value */
	uint32_t ovsr_adj;       /*!< generated over sampling adjustment value */
	uint8_t ovsr_adj_max_bits;  /*!< the maximum bits number of a frame, 9: No parity, 10: with Parity */
	uint8_t ovsr_adj_bits;   /*!< the adjustment bits number in a frame */
	uint8_t reserv1[2];
	const uint16_t *ovsr_adj_map;  /*!< the table for adjustment bits */
	uint32_t max_err;        /*!< maximum baud rate error percentage, 10 ~ 100: 30 */
	uint32_t ovsr_min;       /*!< minum value of OVSR, 10 ~ 20: 1000 */
	uint32_t ovsr_max;       /*!< maximum value of OVSR, 10 ~ 20: 2000 */
	uint32_t divisor_resolution; /*!< the step resolution for availabe divisor value seaching, 1 ~ 20: 10 */
	uint32_t jitter_lim;     /*!< limition for jitter of bits, 50 ~ 100: 100 */
	uint32_t sclk;           /*!< the input system clock */
} uart_speed_setting_t, *puart_speed_setting_t;


#if IS_CUT_TEST(CONFIG_CHIP_VER)
/**
  \brief  The data structure for an UART port HAL operations.
*/
typedef struct hal_uart_adapter_s {

#if UART_UNIFY
	UART_TypeDef *base_addr;    /*!< The UART register base address */
#else
	UART_Type *base_addr;       /*!< The UART register base address */
#endif
	volatile uint32_t state;    /*!< UART state: TX/RX busy, error, timeout */
	uint32_t baudrate;          /*!< The baud rate for configuration  */
	uint32_t flow_ctrl;         /*!< HW flow control setting: enable/disable */
	uint32_t tx_count;          /*!< The number of bytes data for current TX transfer */
	uint32_t rx_count;          /*!< The number of bytes data to be received for current RX transfer */
	uint8_t *ptx_buf;           /*!< the data buffer for TX */
	uint8_t *prx_buf;           /*!< the data buffer for RX */
	uint8_t *ptx_buf_sar;       /*!< the buffer source address for TX */
	uint8_t *prx_buf_dar;       /*!< the buffer destination address for RX */
	uint8_t tx_status;          /*!< TX transfer status (result), includes line error status */
	uint8_t rx_status;          /*!< RX transfer status (result), includes line error status */
	uint8_t uart_idx;           /*!< The UART index number */
	uint8_t word_len;           /*!< frame length select: 0 -> 7 bits, 1 -> 8 bits */
	uint8_t stop_bit;           /*!< stop bit length selection: 0 -> 1 stop bit, 1 -> 2 stop bit */
	uint8_t frame_bits;         /*!< total bits of a frame: start bit + word len + parity bit, it's baud rate calculation related */
	uint8_t parity_type;        /*!< parity check type: 0:Odd, 1: Even */
	uint8_t parity_en;          /*!< parity check enable: 0:no parity check, 1: parity check is enabled */
	uint8_t modem_status;       /*!< the modem status, it's updated in modem status ISR */
	uint8_t tx_dma_burst_size;  /*!< the burst size setting of a TX GDMA transfer */
	uint8_t rx_dma_burst_size;  /*!< the burst size setting of a RX GDMA transfer */
	uint8_t is_inited;          /*!< is UART initialed */
	uint8_t lsr;                /*!< LSR record */
	uint8_t tx_dma_width_1byte; /*!< is force TX DAM 1 byte for each transfer */
	uint8_t rx_dma_width_1byte; /*!< is force RX DAM 1 byte for each transfer */
	uint8_t tx_pin;             /*!< TX pin name */
	uint8_t rx_pin;             /*!< RX pin name */
	uint8_t rts_pin;            /*!< RTS pin name */
	uint8_t cts_pin;            /*!< CTS pin name */
	uint8_t uart_sclk;          /*!< UART SCLK state*/
	uint8_t reserv1;         ///< reserved

	const uint32_t *pdef_baudrate_tbl;      /*!< the pre-defined baud rate table */
	const uint8_t *pdef_ovsr_tbl;           /*!< OVSR table for pre-defined baud rate */
	const uint16_t *pdef_div_tbl;           /*!< the table of DIV for pre-defined baud rate */
	const uint8_t  *pdef_ovsradjbit_tbl10;  /*!< the table of OVSR-Adj bits for 10 bits frame */
	const uint8_t  *pdef_ovsradjbit_tbl9;   /*!< the table of OVSR-Adj bits for 9 bits frame */
	const uint8_t  *pdef_ovsradjbit_tbl8;   /*!< the table of OVSR-Adj bits for 8 bits frame */
	const uint16_t *pdef_ovsradj_tbl10;     /*!< the table of OVSR-Adj for for 10 bits frame */
	const uint16_t *pdef_ovsradj_tbl9;      /*!< the table of OVSR-Adj for for 9 bits frame */
	const uint16_t *pdef_ovsradj_tbl8;      /*!< the table of OVSR-Adj for for 8 bits frame */

