Ameba-AIoT/ameba-arduino-pro2/Arduino_package/hardware/system/component/soc/8735b/fwlib/rtl8735b/include/rtl8735b_uart.h
	uart_callback_t modem_status_ind;       /*!< callback function for modem status indication  */
	uart_irq_callback_t tx_td_callback;     /*!< callback function for THR empty  */
	uart_irq_callback_t rx_dr_callback;     /*!< callback function for RX data ready  */
	uint32_t tx_td_cb_id;                   /*!< the argument for TX THR empty callback function */
	uint32_t rx_dr_cb_id;                   /*!< the argument for RX data ready callback function */
	uint32_t tx_td_cb_ev;                   /*!< the argument for TX THR empty callback function */
	uint32_t rx_dr_cb_ev;                   /*!< the argument for RX data ready callback function */
	uart_callback_t tx_done_callback;           /*!< User callback function for Interrupt / DMA mode Tx complete  */
	uart_callback_t rx_done_callback;           /*!< User callback function for Interrupt / DMA mode Rx complete */
	void *tx_done_cb_para;                      /*!< the argument for TX complete callback function */
	void *rx_done_cb_para;                      /*!< the argument for RX complete callback function */
	uart_lsr_callback_t lsr_callback;           /*!< User callback function for line status error */
	void *lsr_cb_para;                          /*!< the argument for line status error callback function */
	uart_callback_t rx_flt_timeout_callback;    /*!< callback function for RX filter timeout indication  */
	uart_callback_t rx_flt_matched_callback;    /*!< callback function for RX filter matched indication  */
	void *rx_flt_timeout_cb_arg;                /*!< the argument for RX filter timeout callback function */
	void *rx_flt_matched_cb_arg;                /*!< the argument for RX filter matched callback function */
	uart_callback_t rx_idle_timeout_callback;   /*!< callback function for RX idle timeout indication  */
	void *rx_idle_timeout_cb_arg;               /*!< the argument for RX idle timeout callback function */

	hal_gdma_adaptor_t *ptx_gdma;           /*!< The GDMA channel handler for the UART TX */
	hal_gdma_adaptor_t *prx_gdma;           /*!< The GDMA channel handler for the UART RX */

	void (*dcache_invalidate_by_addr)(uint32_t *addr, int32_t dsize);   /*!< callback function to do the D-cache invalidate  */
	void (*dcache_clean_by_addr)(uint32_t *addr, int32_t dsize);        /*!< callback function to do the D-cache clean  */
	void (*hal_sys_peripheral_en_cb)(uint8_t id, uint8_t en);

	// following members are added for B-cut ROM
	uart_callback_t tx_fifo_low_callback;       /*!< User callback function for Interrupt mode Tx event: TX FIFO low  */
	void *tx_fifo_low_cb_para;                  /*!< the argument for TX FIFO low callback function */

	irq_handler_t   irq_fun;                    /*!< the IRQ handler for UART adapters */
} hal_uart_adapter_t, *phal_uart_adapter_t;

#else // Non Test-chip
typedef struct hal_uart_adapter_s {

#if UART_UNIFY
	UART_TypeDef *base_addr;    /*!< The UART register base address */
#else
	UART_Type *base_addr;       /*!< The UART register base address */
#endif
	volatile uint32_t state;    /*!< UART state: TX/RX busy, error, timeout */
	uint32_t baudrate;          /*!< The baud rate for configuration  */
	uint32_t flow_ctrl;         /*!< HW flow control setting: enable/disable */
	uint32_t tx_count;          /*!< The number of bytes data for current TX transfer */
	uint32_t rx_count;          /*!< The number of bytes data to be received for current RX transfer */
	uint32_t tx_pin;             /*!< TX pin name */
	uint32_t rx_pin;             /*!< RX pin name */
	uint32_t rts_pin;            /*!< RTS pin name */
	uint32_t cts_pin;            /*!< CTS pin name */

	uint8_t *ptx_buf;           /*!< the data buffer for TX */
	uint8_t *prx_buf;           /*!< the data buffer for RX */
	uint8_t *ptx_buf_sar;       /*!< the buffer source address for TX */
	uint8_t *prx_buf_dar;       /*!< the buffer destination address for RX */
	uint8_t tx_status;          /*!< TX transfer status (result), includes line error status */
	uint8_t rx_status;          /*!< RX transfer status (result), includes line error status */
	uint8_t uart_idx;           /*!< The UART index number */
	uint8_t word_len;           /*!< frame length select: 0 -> 7 bits, 1 -> 8 bits */
	uint8_t stop_bit;           /*!< stop bit length selection: 0 -> 1 stop bit, 1 -> 2 stop bit */
	uint8_t frame_bits;         /*!< total bits of a frame: start bit + word len + parity bit, it's baud rate calculation related */
	uint8_t parity_type;        /*!< parity check type: 0:Odd, 1: Even */
	uint8_t parity_en;          /*!< parity check enable: 0:no parity check, 1: parity check is enabled */
	uint8_t modem_status;       /*!< the modem status, it's updated in modem status ISR */
	uint8_t tx_dma_burst_size;  /*!< the burst size setting of a TX GDMA transfer */
	uint8_t rx_dma_burst_size;  /*!< the burst size setting of a RX GDMA transfer */
	uint8_t is_inited;          /*!< is UART initialed */
	uint8_t lsr;                /*!< LSR record */
	uint8_t tx_dma_width_1byte; /*!< is force TX DAM 1 byte for each transfer */
	uint8_t rx_dma_width_1byte; /*!< is force RX DAM 1 byte for each transfer */
	uint8_t uart_sclk;          /*!< UART SCLK state*/

	const uint32_t *pdef_baudrate_tbl;      /*!< the pre-defined baud rate table */
	const uint8_t *pdef_ovsr_tbl;           /*!< OVSR table for pre-defined baud rate */
	const uint16_t *pdef_div_tbl;           /*!< the table of DIV for pre-defined baud rate */
	const uint8_t  *pdef_ovsradjbit_tbl10;  /*!< the table of OVSR-Adj bits for 10 bits frame */
	const uint8_t  *pdef_ovsradjbit_tbl9;   /*!< the table of OVSR-Adj bits for 9 bits frame */
	const uint8_t  *pdef_ovsradjbit_tbl8;   /*!< the table of OVSR-Adj bits for 8 bits frame */
	const uint16_t *pdef_ovsradj_tbl10;     /*!< the table of OVSR-Adj for for 10 bits frame */
	const uint16_t *pdef_ovsradj_tbl9;      /*!< the table of OVSR-Adj for for 9 bits frame */
	const uint16_t *pdef_ovsradj_tbl8;      /*!< the table of OVSR-Adj for for 8 bits frame */

