Ameba-AIoT/ameba-arduino-pro2/Arduino_package/hardware/system/component/soc/8735b/fwlib/rtl8735b/include/rtl8735b_uart.h
	uart_callback_t modem_status_ind;       /*!< callback function for modem status indication  */
	uart_irq_callback_t tx_td_callback;     /*!< callback function for THR empty  */
	uart_irq_callback_t rx_dr_callback;     /*!< callback function for RX data ready  */
	uint32_t tx_td_cb_id;                   /*!< the argument for TX THR empty callback function */
	uint32_t rx_dr_cb_id;                   /*!< the argument for RX data ready callback function */
	uint32_t tx_td_cb_ev;                   /*!< the argument for TX THR empty callback function */
	uint32_t rx_dr_cb_ev;                   /*!< the argument for RX data ready callback function */
	uart_callback_t tx_done_callback;           /*!< User callback function for Interrupt / DMA mode Tx complete  */
	uart_callback_t rx_done_callback;           /*!< User callback function for Interrupt / DMA mode Rx complete */
	void *tx_done_cb_para;                      /*!< the argument for TX complete callback function */
	void *rx_done_cb_para;                      /*!< the argument for RX complete callback function */
	uart_lsr_callback_t lsr_callback;           /*!< User callback function for line status error */
	void *lsr_cb_para;                          /*!< the argument for line status error callback function */
	uart_callback_t rx_flt_timeout_callback;    /*!< callback function for RX filter timeout indication  */
	uart_callback_t rx_flt_matched_callback;    /*!< callback function for RX filter matched indication  */
	void *rx_flt_timeout_cb_arg;                /*!< the argument for RX filter timeout callback function */
	void *rx_flt_matched_cb_arg;                /*!< the argument for RX filter matched callback function */
	uart_callback_t rx_idle_timeout_callback;   /*!< callback function for RX idle timeout indication  */
	void *rx_idle_timeout_cb_arg;               /*!< the argument for RX idle timeout callback function */

	hal_gdma_adaptor_t *ptx_gdma;           /*!< The GDMA channel handler for the UART TX */
	hal_gdma_adaptor_t *prx_gdma;           /*!< The GDMA channel handler for the UART RX */

	void (*dcache_invalidate_by_addr)(uint32_t *addr, int32_t dsize);   /*!< callback function to do the D-cache invalidate  */
	void (*dcache_clean_by_addr)(uint32_t *addr, int32_t dsize);        /*!< callback function to do the D-cache clean  */
	void (*hal_sys_peripheral_en_cb)(uint8_t id, uint8_t en);

	// following members are added for B-cut ROM
	uart_callback_t tx_fifo_low_callback;       /*!< User callback function for Interrupt mode Tx event: TX FIFO low  */
	void *tx_fifo_low_cb_para;                  /*!< the argument for TX FIFO low callback function */

	irq_handler_t   irq_fun;                    /*!< the IRQ handler for UART adapters */
	//uint8_t reserv1;            ///< reserved
} hal_uart_adapter_t, *phal_uart_adapter_t;
#endif

/**
  \brief  The data structure to handle the common resource and setting for all UART adapters.
*/
typedef struct hal_uart_group_adapter_s {
	volatile uint32_t critical_lv;                  /*!< to record UART HAL enter critical section level */
	hal_uart_adapter_t *uart_adapter[MaxUartNum];   /*!< All the UART adapters of this platform */
	irq_handler_t   irq_fun[MaxUartNum];            /*!< the IRQ handler for different UART adapters */
} hal_uart_group_adapter_t, *phal_uart_group_adapter_t;

/**
  \brief  The data structure to be used to initial a new UART adapter.
*/
typedef struct hal_uart_defconfig_s {
	uint32_t baudrate;              /*!< The baud rate for configuration  */
	uint8_t flow_ctrl;              /*!< flow control setting */
	uint8_t word_len;               /*!< frame length select: 0 -> 7 bits, 1 -> 8 bits */
	uint8_t stop_bit;               /*!< stop bit length selection: 0 -> 1 stop bit, 1 -> 2 stop bit */
	uint8_t parity_type;            /*!< parity check type: 0:Odd, 1: Even */
	uint8_t parity_en;              /*!< parity check enable: 0: no parity, 1: parity check is enabled */
	uint8_t reserved0[3];

	const uint32_t *pdef_baudrate_tbl;      /*!< the pre-defined baud rate table */
	const uint8_t *pdef_ovsr_tbl;           /*!< OVSR table for pre-defined baud rate */
	const uint16_t *pdef_div_tbl;           /*!< the table of DIV for pre-defined baud rate */
	const uint8_t  *pdef_ovsradjbit_tbl10;  /*!< point to the table of OVSR-Adj bits for 10 bits frame */
	const uint8_t  *pdef_ovsradjbit_tbl9;   /*!< point to the table of OVSR-Adj bits for 9 bits frame */
	const uint8_t  *pdef_ovsradjbit_tbl8;   /*!< point to the table of OVSR-Adj bits for 8 bits frame */
	const uint16_t *pdef_ovsradj_tbl10;     /*!< point to the table of OVSR-Adj for for 10 bits frame */
	const uint16_t *pdef_ovsradj_tbl9;      /*!< point to the table of OVSR-Adj for for 9 bits frame */
	const uint16_t *pdef_ovsradj_tbl8;      /*!< point to the table of OVSR-Adj for for 8 bits frame */
} hal_uart_defconfig_t, *phal_uart_defconfig_t;

/**
  \brief  The data type of a element of the pre-defined baud rate table.
          It's used as the hash for bard rate index searching in the baud rate table.
*/
typedef struct hal_uart_baudrate_hash_s {
	uint32_t baud_rate;  /*!< the baud rate */
	uint32_t idx;        /*!< the index of this baud rate in the baud rate table */
} hal_uart_baudrate_hash_t, *phal_uart_baudrate_hash_t;


/**
 * @addtogroup hs_hal_uart_rom_func UART HAL ROM APIs.
 * @{
 */

/**
 *  @brief To clear a flag from the UART state.
 *
 *  @param[in]  puart_adapter  The UART adapter.
 *  @param[in]  state  The flags(bits) going to be cleared.
 *
 *  @returns    void.
 */
__STATIC_INLINE void uart_clear_state(phal_uart_adapter_t puart_adapter, uint32_t state)
{
	puart_adapter->state &= ~state;
	__DSB();
}

void hal_rtl_uart_en_ctrl(uint8_t uart_idx, BOOL en);

hal_status_t hal_rtl_uart_reset_rx_fifo(phal_uart_adapter_t puart_adapter);
hal_status_t hal_rtl_uart_gen_baudrate(uart_speed_setting_t *pbaud_setting);
hal_status_t hal_rtl_uart_set_baudrate(phal_uart_adapter_t puart_adapter, uint32_t baudrate);
hal_status_t hal_rtl_uart_set_format(phal_uart_adapter_t puart_adapter, uint32_t data_bits,
									 uint32_t parity, uint32_t stop_bits);
hal_status_t hal_rtl_uart_set_flow_control(phal_uart_adapter_t puart_adapter, uint32_t flow_ctrl);
uint8_t hal_rtl_uart_pin_to_idx(uint32_t pin_name, uart_pin_func_t pin_type);
uint8_t hal_rtl_uart_rx_pin_to_idx(uint32_t pin_name);
uint8_t hal_rtl_uart_tx_pin_to_idx(uint32_t pin_name);
uint8_t hal_rtl_uart_rts_pin_to_idx(uint32_t pin_name);
uint8_t hal_rtl_uart_cts_pin_to_idx(uint32_t pin_name);
hal_status_t hal_rtl_uart_set_default_state(phal_uart_adapter_t puart_adapter, phal_uart_defconfig_t pconfig);
hal_status_t hal_rtl_uart_lp_sclk_select(phal_uart_adapter_t puart_adapter, uint8_t sclk_sel);
hal_status_t hal_rtl_uart_init(phal_uart_adapter_t puart_adapter, uint32_t tx_pin, uint32_t rx_pin,
							   phal_uart_defconfig_t pconfig);
void hal_rtl_uart_deinit(phal_uart_adapter_t puart_adapter);
hal_status_t hal_rtl_uart_tx_gdma_init(phal_uart_adapter_t puart_adapter, phal_gdma_adaptor_t pgdma_chnl);
hal_status_t hal_rtl_uart_tx_gdma_deinit(phal_uart_adapter_t puart_adapter);
hal_status_t hal_rtl_uart_rx_gdma_init(phal_uart_adapter_t puart_adapter, phal_gdma_adaptor_t pgdma_chnl);
hal_status_t hal_rtl_uart_rx_gdma_deinit(phal_uart_adapter_t puart_adapter);
BOOL hal_rtl_uart_writeable(phal_uart_adapter_t puart_adapter);
void hal_rtl_uart_putc(phal_uart_adapter_t puart_adapter, uint8_t tx_data);
void hal_rtl_uart_wputc(phal_uart_adapter_t puart_adapter, uint8_t tx_data);
void hal_rtl_uart_wait_tx_done(phal_uart_adapter_t puart_adapter, uint32_t timeout_ms);
uint32_t hal_rtl_uart_send(phal_uart_adapter_t puart_adapter, uint8_t *ptx_buf, uint32_t len, uint32_t timeout_ms);
hal_status_t hal_rtl_uart_int_send(phal_uart_adapter_t puart_adapter, uint8_t *ptx_buf, uint32_t len);
hal_status_t hal_rtl_uart_dma_send(phal_uart_adapter_t puart_adapter, uint8_t *ptx_buf, uint32_t len);
hal_status_t hal_rtl_uart_send_abort(phal_uart_adapter_t puart_adapter);
BOOL hal_rtl_uart_readable(phal_uart_adapter_t puart_adapter);
char hal_rtl_uart_getc(phal_uart_adapter_t puart_adapter);
int hal_rtl_uart_rgetc(phal_uart_adapter_t puart_adapter, char *data);
uint32_t hal_rtl_uart_recv(phal_uart_adapter_t puart_adapter, uint8_t *prx_buf, uint32_t len, uint32_t timeout_ms);
hal_status_t hal_rtl_uart_int_recv(phal_uart_adapter_t puart_adapter, uint8_t *prx_buf, uint32_t len);
hal_status_t hal_rtl_uart_dma_recv(phal_uart_adapter_t puart_adapter, uint8_t *prx_buf, uint32_t len);
uint32_t hal_rtl_uart_recv_abort(phal_uart_adapter_t puart_adapter);
uint8_t hal_rtl_uart_get_imr(phal_uart_adapter_t puart_adapter);
void hal_rtl_uart_set_imr(phal_uart_adapter_t puart_adapter);
void hal_rtl_uart_set_rts(phal_uart_adapter_t puart_adapter, BOOLEAN rts_ctrl);
void hal_rtl_uart_tx_pause(phal_uart_adapter_t puart_adapter, BOOLEAN cts_ctrl);
void hal_rtl_uart_reg_irq(phal_uart_adapter_t puart_adapter, irq_handler_t handler);
void hal_rtl_uart_unreg_irq(phal_uart_adapter_t puart_adapter);
void hal_rtl_uart_adapter_init(phal_uart_adapter_t puart_adapter, uint8_t uart_idx, phal_uart_defconfig_t pconfig);
void hal_rtl_uart_line_sts_hook(phal_uart_adapter_t puart_adapter, uart_lsr_callback_t pcallback, void *pdata);
void hal_rtl_uart_rxind_hook(phal_uart_adapter_t puart_adapter, uart_irq_callback_t pcallback,
							 uint32_t id, uint32_t event);
void hal_rtl_uart_txtd_hook(phal_uart_adapter_t puart_adapter, uart_irq_callback_t pcallback,
							uint32_t id, uint32_t event);
void hal_rtl_uart_txdone_hook(phal_uart_adapter_t puart_adapter, uart_callback_t pcallback, void *parg);
void hal_rtl_uart_rxdone_hook(phal_uart_adapter_t puart_adapter, uart_callback_t pcallback, void *parg);
void hal_rtl_uart_set_rx_filter_pattern(phal_uart_adapter_t puart_adapter, uint32_t pattern,
										uint32_t mask, uint32_t mask_en);
void hal_rtl_uart_set_rx_filter_op(phal_uart_adapter_t puart_adapter, uint32_t pattern_len, uint32_t match_op);
void hal_rtl_uart_set_rx_filter_timeout(phal_uart_adapter_t puart_adapter, uint32_t timeout_ms,
										uart_callback_t callback, void *cb_arg);
void hal_rtl_uart_rx_filter_en(phal_uart_adapter_t puart_adapter, uart_callback_t callback, void *cb_arg);
void hal_rtl_uart_rx_filter_dis(phal_uart_adapter_t puart_adapter);
void hal_rtl_uart_reset_receiver(phal_uart_adapter_t puart_adapter);
void hal_rtl_uart_set_tx_fifo_level(phal_uart_adapter_t puart_adapter, uint32_t low_level);
void hal_rtl_uart_set_rx_fifo_level(phal_uart_adapter_t puart_adapter, uint32_t level);
void hal_rtl_uart_rx_idle_timeout_en(phal_uart_adapter_t puart_adapter, uint32_t timeout_us,
									 uart_callback_t pcallback, void *parg);
void hal_rtl_uart_rx_idle_timeout_dis(phal_uart_adapter_t puart_adapter);
void hal_rtl_uart_tx_fifo_low_hook(phal_uart_adapter_t puart_adapter, uart_callback_t pcallback,
								   void *parg);
void hal_rtl_uart_baud_rate_table_dump(uint32_t sclk, uint32_t *baudrate_tbl);
hal_status_t hal_rtl_uart_load_default_state(phal_uart_adapter_t puart_adapter, phal_uart_defconfig_t pconfig);


#if 0 // Raymond
void hal_rtl_uart_func_en_ctrl(uint8_t uart_idx, BOOL en);
void hal_rtl_uart_bus_en_ctrl(uint8_t uart_idx, BOOL en);
void hal_rtl_uart_pclk_en_ctrl(uint8_t uart_idx, BOOL en);
void hal_rtl_uart_sclk_en_ctrl(uint8_t uart_idx, BOOL en);
#endif

/** @} */ /* End of group hs_hal_uart_rom_func */
/// @endcond /* End of condition DOXYGEN_ROM_HAL_API */
/**
  \brief  The data structure of the stubs functions of the UART HAL functions in ROM.
*/
typedef struct hal_uart_func_stubs_s {
	hal_status_t (*hal_uart_reset_rx_fifo)(phal_uart_adapter_t puart_adapter);
	hal_status_t (*hal_uart_gen_baudrate)(uart_speed_setting_t *pbaud_setting);
	hal_status_t (*hal_uart_set_baudrate)(phal_uart_adapter_t puart_adapter, uint32_t baudrate);
	hal_status_t (*hal_uart_set_format)(phal_uart_adapter_t puart_adapter, uint32_t data_bits,
										uint32_t parity, uint32_t stop_bits);
	hal_status_t (*hal_uart_set_flow_control)(phal_uart_adapter_t puart_adapter, uint32_t flow_ctrl);
	hal_status_t (*hal_uart_init)(phal_uart_adapter_t puart_adapter, uint32_t tx_pin, uint32_t rx_pin,
								  phal_uart_defconfig_t pconfig);
	void (*hal_uart_deinit)(phal_uart_adapter_t puart_adapter);
	void (*uart_irq_handler)(phal_uart_adapter_t puart_adapter);
	hal_status_t (*hal_uart_tx_gdma_init)(phal_uart_adapter_t puart_adapter, phal_gdma_adaptor_t pgdma_chnl);
	hal_status_t (*hal_uart_tx_gdma_deinit)(phal_uart_adapter_t puart_adapter);
	hal_status_t (*hal_uart_rx_gdma_init)(phal_uart_adapter_t puart_adapter, phal_gdma_adaptor_t pgdma_chnl);
	hal_status_t (*hal_uart_rx_gdma_deinit)(phal_uart_adapter_t puart_adapter);
	void (*uart_tx_dma_irq_handler)(phal_uart_adapter_t puart_adapter);
	void (*uart_rx_dma_irq_handler)(phal_uart_adapter_t puart_adapter);
	BOOL (*hal_uart_writeable)(phal_uart_adapter_t puart_adapter);
	void (*hal_uart_putc)(phal_uart_adapter_t puart_adapter, uint8_t tx_data);
	void (*hal_uart_wputc)(phal_uart_adapter_t puart_adapter, uint8_t tx_data);
	void (*hal_uart_wait_tx_done)(phal_uart_adapter_t puart_adapter, uint32_t timeout_ms);
	uint32_t (*hal_uart_send)(phal_uart_adapter_t puart_adapter, uint8_t *ptx_buf, uint32_t len, uint32_t timeout_ms);
	hal_status_t (*hal_uart_int_send)(phal_uart_adapter_t puart_adapter, uint8_t *ptx_buf, uint32_t len);
	hal_status_t (*hal_uart_dma_send)(phal_uart_adapter_t puart_adapter, uint8_t *ptx_buf, uint32_t len);
	uint32_t (*hal_uart_send_abort)(phal_uart_adapter_t puart_adapter);
	BOOL (*hal_uart_readable)(phal_uart_adapter_t puart_adapter);
	char (*hal_uart_getc)(phal_uart_adapter_t puart_adapter);
	int (*hal_uart_rgetc)(phal_uart_adapter_t puart_adapter, char *data);
	uint32_t (*hal_uart_recv)(phal_uart_adapter_t puart_adapter, uint8_t *prx_buf, uint32_t len, uint32_t timeout_ms);
	hal_status_t (*hal_uart_int_recv)(phal_uart_adapter_t puart_adapter, uint8_t *prx_buf, uint32_t len);
	hal_status_t (*hal_uart_dma_recv)(phal_uart_adapter_t puart_adapter, uint8_t *prx_buf, uint32_t len);
	uint32_t (*hal_uart_recv_abort)(phal_uart_adapter_t puart_adapter);
	uint8_t (*hal_uart_get_imr)(phal_uart_adapter_t puart_adapter);
	void (*hal_uart_set_imr)(phal_uart_adapter_t puart_adapter);
	void (*hal_uart_set_rts)(phal_uart_adapter_t puart_adapter, BOOLEAN rts_ctrl);
	void (*hal_uart_tx_pause)(phal_uart_adapter_t puart_adapter, BOOLEAN cts_ctrl);
	void (*hal_uart_reg_irq)(phal_uart_adapter_t puart_adapter, irq_handler_t handler);
	void (*hal_uart_unreg_irq)(phal_uart_adapter_t puart_adapter);
	void (*hal_uart_adapter_init)(phal_uart_adapter_t puart_adapter, uint8_t uart_idx, phal_uart_defconfig_t pconfig);
	void (*hal_uart_line_sts_hook)(phal_uart_adapter_t puart_adapter, uart_lsr_callback_t pcallback, void *pdata);
	void (*hal_uart_txtd_hook)(phal_uart_adapter_t puart_adapter, uart_irq_callback_t pcallback, uint32_t id, uint32_t event);
	void (*hal_uart_rxind_hook)(phal_uart_adapter_t puart_adapter, uart_irq_callback_t pcallback, uint32_t id, uint32_t event);
	void (*hal_uart_txdone_hook)(phal_uart_adapter_t puart_adapter, uart_callback_t pcallback, void *parg);
	void (*hal_uart_rxdone_hook)(phal_uart_adapter_t puart_adapter, uart_callback_t pcallback, void *parg);
	void (*hal_uart_set_rx_filter_pattern)(phal_uart_adapter_t puart_adapter, uint32_t pattern,
										   uint32_t mask, uint32_t mask_en);
	void (*hal_uart_set_rx_filter_op)(phal_uart_adapter_t puart_adapter, uint32_t pattern_len, uint32_t match_op);
	void (*hal_uart_set_rx_filter_timeout)(phal_uart_adapter_t puart_adapter, uint32_t timeout_ms,
										   uart_callback_t callback, void *cb_arg);
	void (*hal_uart_rx_filter_en)(phal_uart_adapter_t puart_adapter, uart_callback_t callback, void *cb_arg);
	void (*hal_uart_rx_filter_dis)(phal_uart_adapter_t puart_adapter);
	void (*hal_uart_reset_receiver)(phal_uart_adapter_t puart_adapter);
	void (*hal_uart_set_tx_fifo_level)(phal_uart_adapter_t puart_adapter, uint32_t low_level);
	void (*hal_uart_set_rx_fifo_level)(phal_uart_adapter_t puart_adapter, uint32_t level);
	void (*hal_uart_rx_idle_timeout_en)(phal_uart_adapter_t puart_adapter, uint32_t timeout_us,
										uart_callback_t pcallback, void *parg);
	void (*hal_uart_rx_idle_timeout_dis)(phal_uart_adapter_t puart_adapter);
	void (*hal_uart_en_ctrl)(uint8_t uart_idx, BOOL en);
	void (*hal_uart_tx_fifo_low_hook)(phal_uart_adapter_t puart_adapter, uart_callback_t pcallback, void *parg);
	uint8_t (*hal_uart_pin_to_idx)(uint32_t pin_name, uart_pin_func_t pin_type);
	void (*hal_uart_tx_isr)(phal_uart_adapter_t puart_adapter);
	void (*hal_uart_rx_isr)(phal_uart_adapter_t puart_adapter);
	void (*hal_uart_iir_isr)(phal_uart_adapter_t puart_adapter);
	void (*hal_uart_baud_rate_table_dump)(uint32_t sclk, uint32_t *baudrate_tbl);
	hal_status_t (*hal_uart_lp_sclk_select)(phal_uart_adapter_t puart_adapter, uint8_t sclk_sel);
	hal_status_t (*hal_uart_set_default_state)(phal_uart_adapter_t puart_adapter, phal_uart_defconfig_t pconfig);
	hal_status_t (*hal_uart_load_default_state)(phal_uart_adapter_t puart_adapter, phal_uart_defconfig_t pconfig);
	uint32_t reserved[11];  // reserved space for next ROM code version function table extending.
} hal_uart_func_stubs_t;


/** @} */ /* End of group hs_hal_uart */

#ifdef __cplusplus
}
#endif

#endif  // #ifndef _RTL_8735B_UART_H_

